Catalogs/УниверсальныеРабочиеМестаКассиров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>УниверсальныеРабочиеМестаКассиров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектУРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппыКатегории</Name>
					<Comment>Настройка распределения продаж номенклатуры по группам, либо категориям</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КассыККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КассаККМУРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециальныйНалоговыйРежим</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпециальныеНалоговыеРежимы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Патент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпециальныеНалоговыеРежимы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СпециальныеНалоговыеРежимы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПрименяется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УниверсальныеРабочиеМестаКассиров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ЗаполнитьТЧКассыККМ();

	УзелУРМКСсылка 		= ПланыОбмена.ОбменСУРМК.НайтиПоРеквизиту("УРМК", ТекущийОбъект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешенРасширенныйРежимНастройкиОбменаУРМК = ИнтеграцияУРМКПереопределяемый.РазрешенРасширенныйРежимНастройкиОбменаУРМК();
	
	Если Не РазрешенРасширенныйРежимНастройкиОбменаУРМК Тогда
		ТекстСообщения = НСтр("ru = 'Форма не предназначена для непосредственного использования.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ИнтеграцияУРМКПереопределяемый.УстановитьПараметрыВыбораКассыККМ(ЭтотОбъект, "КассыККМКассаККМ");
	ИнтеграцияУРМКПереопределяемый.УстановитьПараметрыВыбораКассыККМ(ЭтотОбъект, "РаспределениеНоменклатурыКассаККМ");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		Оповестить("ОбновлениеОтборовНаУзле");
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ЗаполнитьТЧКассыККМ()
	
	ПустаяСсылкаКассаККМ = Метаданные.ОпределяемыеТипы.КассаККМУРМК.Тип.ПривестиЗначение();
	ПустаяСсылкаОрганизация = Метаданные.ОпределяемыеТипы.ОрганизацияУРМК.Тип.ПривестиЗначение();
	
	ОрганизацияТипРеквизитаСтрокой = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(ПустаяСсылкаОрганизация));
	ИмяРеквизитаОрганизация = ИнтеграцияУРМКСлужебный.ИменаРеквизитовПоТипу(ПустаяСсылкаКассаККМ, Тип(ОрганизацияТипРеквизитаСтрокой));
	
	Если ИмяРеквизитаОрганизация = "" Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаДанных Из Объект.КассыККМ Цикл
		СтрокаДанных.Организация = СтрокаДанных.КассаККМ[ИмяРеквизитаОрганизация];
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КассыККМПриИзменении(Элемент)
	ЗаполнитьТЧКассыККМ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспределениеНоменклатуры

&НаКлиенте
Процедура ГруппыКатегорииПриИзменении(Элемент)
	
	Если Объект.РаспределениеНоменклатуры.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбОчисткеРаспределения", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Настройки распределения будут очищены. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		НастроитьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНоменклатурыГруппаНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	НайденныеСтроки = Объект.РаспределениеНоменклатуры.НайтиСтроки(Новый Структура("ГруппаНоменклатуры", ВыбранноеЗначение));
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбранная группа уже присутствует в таблице'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНоменклатурыКатегорияНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	НайденныеСтроки = Объект.РаспределениеНоменклатуры.НайтиСтроки(Новый Структура("КатегорияНоменклатуры", ВыбранноеЗначение));
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбранная категория уже присутствует в таблице'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФорму()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РаспределениеНоменклатурыГруппаНоменклатуры", "Видимость", Объект.ГруппыКатегории = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РаспределениеНоменклатурыКатегорияНоменклатуры", "Видимость", Объект.ГруппыКатегории = 1);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаРаспределениеНоменклатуры", "Видимость", РазрешенРасширенныйРежимНастройкиОбменаУРМК);
	
	ЕстьЕСХН = Ложь;
	Для Каждого СтрокаРаспределения Из Объект.РаспределениеНоменклатуры Цикл
		Если СтрокаРаспределения.СпециальныйНалоговыйРежим = ПредопределенноеЗначение("Перечисление.СпециальныеНалоговыеРежимы.ЕСХН") Тогда
			ЕстьЕСХН = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьЕСХН Тогда
		Для Каждого СтрокаРаспределения Из Объект.РаспределениеНоменклатуры Цикл
			СтрокаРаспределения.УчетНДС = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РаспределениеНоменклатурыУчетНДС", "Видимость", ЕстьЕСХН);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбОчисткеРаспределения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.РаспределениеНоменклатуры.Очистить();
		НастроитьФорму();
	Иначе
		Объект.ГруппыКатегории = Число(Не Булево(Объект.ГруппыКатегории));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНоменклатурыСпециальныйНалоговыйРежимПриИзменении(Элемент)
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеНоменклатурыУчетНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РаспределениеНоменклатуры.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.СпециальныйНалоговыйРежим = ПредопределенноеЗначение("Перечисление.СпециальныеНалоговыеРежимы.ЕСХН") Тогда
		ТекущиеДанные.УчетНДС = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
